[
  {
    "Termo": "2FA",
    "Definição": "A autenticação de dois fatores ou 2FA é o processo de autenticação em que dois fatores de autenticação são combinados. Ex: senha e SMS ou senha e app autenticador.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, ferramentas, back-end"
  },
  {
    "Termo": "Abstração",
    "Definição": "O termo abstração é usado para descrever a aplicação de conceitos de programação para problemas do mundo real de forma que os detalhes de implementação possam ser ignorados.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, fundamentos."
  },
  {
    "Termo": "Adaptative Design",
    "Definição": "É o processo de criação de vários layouts fixos para vários tamanhos de tela. Em resumo, um designer pode criar experiências completamente diferentes para telefones, tablets e desktops.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos, fundamentos, front-end, infraestrutura"
  },
  {
    "Termo": "Agile",
    "Definição": "O Agile é um metodo de desenvolvimento de software que ajuda as empresas a projetar e construir produtos cujos requisitos são pouco conhecidos ou sujeito à mudanças.",
    "Dificuldade": "Profissional",
    "Tags": "infraestrutura, conceitos"
  },
  {
    "Termo": "Ajax",
    "Definição": "É o uso do objeto XMLHttpRequest para se comunicar com os scripts do lado do servidor. Ele pode enviar bem como receber informações em uma variedade de formatos, incluindo JSON, XML, HTML, e até mesmo arquivos de texto.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos, ferramentas, back-end, front-end"
  },
  {
    "Termo": "Algoritimo",
    "Definição": "Sequência finita de regras, raciocínios ou operações que, aplicada a um número finito de dados, permite solucionar classes semelhantes de problemas.",
    "Dificuldade": "Iniciante",
    "Tags": "fundamentos, conceitos, infraestrututa"
  },
  {
    "Termo": "AngularJs",
    "Definição": "O AngularJS é um framework de código aberto usado para construir a interface de aplicativos web.",
    "Dificuldade": "Intermediário",
    "Tags": "bibliotecas/framework, front-end, ferramentas"
  },
  {
    "Termo": "Apache",
    "Definição": "O Apache é um servidor web open source. Ele é um dos produtos mais populares da Apache Software Foundation, e é amplamente utilizado para a hospedagem de sites e aplicações web.",
    "Dificuldade": "Intermediário",
    "Tags": "infraestrutura, ferramentas"
  },
  {
    "Termo": "API",
    "Definição": "Uma API (application programming interface) é a interface de programação de um aplicativo que permite a interação com outros aplicativos.",
    "Dificuldade": "Iniciante",
    "Tags": "infraestrutura, conceitos, fundamentos"
  },
  {
    "Termo": "Aplicação Monolítica",
    "Definição": "Uma aplicação monolítica é uma aplicação que consiste em um único componente executável. Isso significa que todos os componentes do software estão contidos e executados dentro do mesmo processo e acessam uma única base de dados.",
    "Dificuldade": "Profissional",
    "Tags": "conceitos, infraestrutura"
  },
  {
    "Termo": "App",
    "Definição": "Programa de computador concebido para processar dados eletronicamente, facilitando e reduzindo o tempo de execução de uma tarefa pelo usuário.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, ferramentas"
  },
  {
    "Termo": "Arquitetura Hexagonal",
    "Definição": "A arquitetura hexagonal é uma estrutura de software que visa facilitar o desenvolvimento de aplicações altamente flexíveis e evolutivas.",
    "Dificuldade": "Profissional",
    "Tags": "conceitos, infraestrutura"
  },
  {
    "Termo": "Array",
    "Definição": "Um array é um conjunto de dados que podem ser acessados pelo índice de cada elemento. Arrays são muito úteis para guardar valores em uma estrutura de dados e podem ser usados em muitas situações diferentes.",
    "Dificuldade": "essencial",
    "Tags": "fundamentos, conceitos"
  },
  {
    "Termo": "Ascii",
    "Definição": "ASCII é um código de símbolos que usa 7 bits para representar um conjunto de caracteres. É um dos códigos de caracteres mais antigos e mais amplamente utilizados e está incluído em muitos formatos de texto.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas, conceitos, fundamentos"
  },
  {
    "Termo": "Atributos",
    "Definição": "Em computação, um atributo é uma propriedade associada a um objeto, que pode ser acessada e manipulada pelos métodos do objeto.",
    "Dificuldade": "Iniciante",
    "Tags": "infraestrutura, conceitos, fundamentos"
  },
  {
    "Termo": "Autenticação",
    "Definição": "A autenticação é o processo de verificar a identidade de um usuário. Geralmente, isso é feito através da entrada de um nome de usuário e uma senha.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, ferramentas"
  },
  {
    "Termo": "Autorização",
    "Definição": "Autorização é o processo de conceder a um usuário ou programa acesso a determinadas informações ou recursos. O processo de autorização geralmente envolve a verificação de se o usuário tem as permissões adequadas para executar a ação desejada.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "AWS",
    "Definição": "A Amazon Web Services (AWS) é a plataforma de nuvem mais adotada e mais abrangente do mundo, oferecendo mais de 200 serviços completos de datacenters em todo o mundo.",
    "Dificuldade": "Intermediário",
    "Tags": "infraestrutura, ferramentas,  back-end"
  },
  {
    "Termo": "Back-End",
    "Definição": "Back-end se relaciona com o que está por trás das aplicações desenvolvidas na programação. Ou seja, tudo que dá estrutura e apoio às ações do usuário, como o armazenamento de dados e a integração com outros sistemas.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, fundamentos"
  },
  {
    "Termo": "Backlog",
    "Definição": "Backlog é uma “pilha de pedidos” em espera.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos, infraestrutura"
  },
  {
    "Termo": "Sprint Velocity",
    "Definição": "Uma medida de tempo (dias, horas etc) que representa o período em que uma determinada força de trabalho (equipe) pode finalizar uma determinada carteira acumulada de serviços.",
    "Dificuldade": "Profissional",
    "Tags": "conceitos"
  },
  {
    "Termo": "Backup",
    "Definição": "O termo americano backup significa “cópia de segurança”, e corresponde a criação e armazenamento de cópias de arquivos digitais importantes, de modo que seja possível realizar sua restauração em caso de perda dos arquivos originais.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Banco de Dados",
    "Definição": "Um banco de dados é uma coleção organizada de informações - ou dados - estruturadas, normalmente armazenadas eletronicamente em um sistema de computador (servidor).",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas, conceitos, fundamentos, infraestrutura"
  },
  {
    "Termo": "Biblioteca",
    "Definição": "Coleção de subprogramas usados no desenvolvimento de softwares. A sua principal função é facilitar a programação, garantindo mais agilidade e menos erros.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas, conceitos, fundamentos, infraestrutura"
  },
  {
    "Termo": "Bit",
    "Definição": "Menor parcela de informação processada por um computador; algarismo do sistema binário que somente pode assumir as formas 0 ou 1.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, fundamentos"
  },
  {
    "Termo": "Bool",
    "Definição": "Um booleano, em ciência da computação, é um tipo de dado lógico que pode ter apenas um de dois valores possíveis: verdadeiro ou falso (true or false).",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, fundamentos"
  },
  {
    "Termo": "Bootstrap",
    "Definição": "Bootstrap é um framework front-end que fornece estruturas de CSS para a criação de sites e aplicações responsivas de forma rápida e simples. Além disso, pode lidar com sites de desktop e páginas de dispositivos móveis da mesma forma.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas, biblioteca/framework"
  },
  {
    "Termo": "Branch",
    "Definição": "Uma branch é uma ramificação do código principal de um repositório Git. Serve como um novo caminho para a evolução do código e pode posteriormente ser incorporado de volta ao código principal. É muito útil para trabalho em equipe e a construção de funções em paralelo.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, fundamentos"
  },
  {
    "Termo": "Browser / Navegador",
    "Definição": "Browser ou Navegador é um programa criado para permitir a navegação pela internet. É o que torna possível o acesso a sites, como um caminho que leva até o que você procura na rede.",
    "Dificuldade": "Iniciante",
    "Tags": "programas"
  },
  {
    "Termo": "Bug",
    "Definição": "Defeito, falha ou erro no código de um programa que provoca seu mau funcionamento.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, fundamentos"
  },
  {
    "Termo": "Byte",
    "Definição": "É uma unidade de informação digital equivalente a oito bits.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, fundamentos"
  },
  {
    "Termo": "C",
    "Definição": "Linguagem de programação compilada de propósito geral para computadores voltada para o desenvolvimento de sistemas.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, ferramentas"
  },
  {
    "Termo": "C#",
    "Definição": "É uma linguagem de programação orientada a objetos, que foi desenvolvida pela Microsoft e faz parte da plataforma .NET. Embora a linguagem C# tenha sido criada do zero, foi baseada na linguagem C++ e tem muitos elementos da linguagem Pascal e Java.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, ferramentas"
  },
  {
    "Termo": "C++",
    "Definição": "C++ é uma linguagem de programação criada à partir da linguagem C, oferecendo inúmeras funcionalidades adicionais como programação orientada a objetos.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, ferramentas"
  },
  {
    "Termo": "Cache",
    "Definição": "É um componente de software ou hardware que garantem que requisições frequentes sejam retornadas com maior velocidade. Exemplos: cache de memória, web cache e memoization.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Call Stack",
    "Definição": "Mecanismo do interpretador de uma linguagem que organiza o funcionamento do script quando são chamadas muitas funções, qual função está sendo executada no momento, e quais serão chamadas dentro de alguma função.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Catch",
    "Definição": "Catch marca um bloco de declarações para testar (try), e especifica uma ação ou resposta, caso uma exceção (erro ou condição inesperada) seja obtida.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "CD",
    "Definição": "Continuous Deployment, é uma prática de desenvolvimento de software na qual cada alteração de código passa por todo o pipeline e é colocada em produção automaticamente, facilitando e evitando erros na implantação de novas versões.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "CDN",
    "Definição": "Uma CDN é uma rede de servidores que distribui conteúdo de um servidor de \"origem\" no mundo todo, armazenando o conteúdo em cache próximo ao local em que cada usuário final está acessando a Internet por meio de um dispositivo habilitado para Web.",
    "Dificuldade": "Intermediário",
    "Tags": "infraestrutura, conceitos"
  },
  {
    "Termo": "Char",
    "Definição": "O tipo char serve para armazenar um caractere. O tipo char aloca 1 byte de memória para guardar nosso caractere.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "Checkbox",
    "Definição": "Checkbox é um tipo de caixa de seleção usada para permitir que um usuário selecione múltiplas opções de um conjunto.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "CI",
    "Definição": "Automação para a integração de uma mudança de código em um ambiente compartilhado com a equipe do projeto para a validação e testes (manuais e automatizados) da mudança proposta. Agiliza o processo de testes, validação e auxilia na redução de erros.",
    "Dificuldade": "Profissional",
    "Tags": "conceitos"
  },
  {
    "Termo": "Classe",
    "Definição": "Uma classe é uma forma de definir um tipo de dado em uma linguagem orientada a objeto. Ela é formada por dados e comportamentos. Para definir os dados são utilizados os atributos, e para definir o comportamento são utilizados métodos.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "Cliente",
    "Definição": "Cliente\" é um termo empregado em computação e representa uma entidade que consome os serviços de uma outra entidade servidora, em geral através do uso de uma rede de computadores numa arquitetura cliente-servidor.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Cliente",
    "Definição": "Usado para se referir a um efetivo ou potencial adquirente/usuário de produtos (na compra ou aluguel de bens) e/ou serviços oferecidos por um indivíduo ou por uma organização (chamado de fornecedor ou vendedor).",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Cloud",
    "Definição": "É uma tecnologia que permite acesso remoto a softwares, armazenamento de arquivos e processamento de dados por meio da internet. É uma alternativa para você acessar dados importantes de qualquer computador, em qualquer lugar.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "CMS",
    "Definição": "CMS é um software que permite a criação, edição e gerenciamento de conteúdo em um site. É usado por profissionais de marketing, web design e desenvolvimento de sites para criar e manter sites complexos",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Code Review",
    "Definição": "Consiste na prática de fazer revisões no código de uma determinada aplicação. Normalmente, essa revisão é feita por um desenvolvedor que não o autor.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Codebase",
    "Definição": "A codebase é o conjunto de todos os arquivos de código fonte que um projeto de software possui.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos, infraestrutura"
  },
  {
    "Termo": "Código Fonte",
    "Definição": "Código-fonte são as linhas de programação que formam um software em sua forma original. Inicialmente, um programador \"escreve\" o programa em uma certa linguagem.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, fundamentos"
  },
  {
    "Termo": "Comando",
    "Definição": "Sinal enviado pelo usuário a um programa ou sistema operacional com o objetivo de iniciar, finalizar, modificar ou controlar de alguma forma a execução do programa ou de uma operação.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "Commit",
    "Definição": "Pode ser referir a bancos de dados ou repositórios Git. Para ambos, um commit é tornar um conjunto de mudanças provisórias em permanentes.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "Compilador",
    "Definição": "Um compilador é um programa de sistema que traduz um programa descrito em uma linguagem de alto nível para um programa equivalente em código de máquina para um processador.",
    "Dificuldade": "Iniciante",
    "Tags": "programas, ferramentas"
  },
  {
    "Termo": "Complexidade de Algoritimos",
    "Definição": "Complexidade de algoritmo é a estudo e a medição de quanto tempo e quanto de memória um algoritmo gasta de acordo com tamanhos diferentes de entrada.",
    "Dificuldade": "Profissional",
    "Tags": "conceitos, infraestrutura"
  },
  {
    "Termo": "Condicional",
    "Definição": "As estruturas condicionais permitem que um programa execute comandos quando uma condição estabelecida está presente. Exemplo: gerar um erro (comando) caso o e-mail de destino seja inválido (condicional).",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, fundamentos"
  },
  {
    "Termo": "Containers",
    "Definição": "Container é um delimitador abstrato, ou seja, um objeto que contém outros objetos que podem ser incluídos ou removidos dinamicamente. Pode se referir tanto a um pedaço de código quanto a infraestrutura (Docker).",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, comandos"
  },
  {
    "Termo": "Cookie",
    "Definição": "Um pequeno arquivo que é salvo no computador das pessoas para ajudar a armazenar as preferências e outras informações usadas nas páginas da Web que elas visitam.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, front-end"
  },
  {
    "Termo": "Cors",
    "Definição": "O CORS (Cross-origin Resource Sharing) é um mecanismo utilizado pelos navegadores para compartilhar recursos entre diferentes origens. O CORS é uma especificação doO CORS (Cross-origin Resource Sharing) é um mecanismo utilizado pelos navegadores para compartilhar recursos entre diferentes origens. O CORS é uma especificação do W3C e faz uso de headers do HTTP para informar aos navegadores se determinado recurso pode ser ou não acessado.\n W3C e faz uso de headers do HTTP para informar aos navegadores se determinado recurso pode ser ou não acessado.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "CPU",
    "Definição": "Ele é o principal item de hardware do computador, que também é conhecido como processador. A CPU é responsável por calcular e realizar tarefas determinadas pelo usuário e é considerado o cérebro do PC.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas, infraestrutura"
  },
  {
    "Termo": "CQRS",
    "Definição": "O CQRS significa Segregação de Responsabilidade de Comando e Consulta, um padrão que separa as operações de leitura e atualização de um armazenamento de dados.",
    "Dificuldade": "Profissional",
    "Tags": "conceitos, infraestrutura"
  },
  {
    "Termo": "Criptografia",
    "Definição": "Conversão de dados de um formato legível em um formato codificado. Os dados criptografados só podem ser lidos ou processados depois de serem descriptografados. São exemplos de algorítmos criptográficos.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "CRM",
    "Definição": "CRM é um software que ajuda as empresas a gerenciar e acompanhar as interações com os seus clientes. CRM também pode ajudar as empresas a gerenciar suas vendas.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas, programas"
  },
  {
    "Termo": "CRUD",
    "Definição": "CRUD (Create, Read, Update, Delete) é um acrônimo para as maneiras de se operar em informação armazenada. É um mnemônico para as quatro operações básicas de armazenamento persistente. Em geral se refere a um sistema ou parte de um sistema que contenha apenas essas operações.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "CSP",
    "Definição": "Content Security Policy é uma camada de segurana para detectar e mitigar alguns tipo de ataques.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos, ferramentas"
  },
  {
    "Termo": "CSS",
    "Definição": "Trata-se de uma linguagem de marcação.",
    "Dificuldade": "Iniciante",
    "Tags": "fundamentos, conceitos, front-end"
  },
  {
    "Termo": "Day.js",
    "Definição": "Day. js é uma pequena biblioteca JavaScript que nos permite parsear, manipular, validar e mostrar datas e horários em navegadores modernos.",
    "Dificuldade": "Intermediário",
    "Tags": "bibliotecas"
  },
  {
    "Termo": "DBMS",
    "Definição": "Um Sistema de Gerenciamento de Banco de Dados (SGBD) do inglês Data Base Management System (DBMS) é o sistema de software responsável pelo gerenciamento de um ou mais bancos de dados.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos, ferramentas"
  },
  {
    "Termo": "DDD",
    "Definição": "Sigla para Domain-Driven Design, que consiste em um padrão de modelagem para softwares, cujo objetivo é facilitar a implementação de regras e processos complexos, além da divisão de responsabilidades por camadas.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Debug",
    "Definição": "Também chamado de debugging ou, em português, depuração, é o nome dado ao processo de encontrar e remover os erros que podem acometer softwares e hardwares. Um debugger é um programa que auxilia esse processo.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Dependência",
    "Definição": "Biblioteca ou serviço externo que um software precisa para funcionar corretamente.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Deployment",
    "Definição": "O verbo deploy, em inglês, quer dizer implantar. Fazer um deploy, em termos práticos, significa colocar no ar alguma aplicação.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, infraestrutura"
  },
  {
    "Termo": "Dev",
    "Definição": "Abreviação de Developer. Pessoa que sabe como desenvolver software. Eles também são chamados de: programadores, coders, engenheiros de software e outros.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Diagrama de caso de uso",
    "Definição": "Na Linguagem de modelagem unificada (UML), o diagrama de caso de uso resume os detalhes dos usuários do seu sistema (também conhecidos como atores) e as interações deles com o sistema. Para criar um, usa um conjunto de símbolos e conectores especializados.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Display",
    "Definição": "Dispositivo para a apresentação de informação.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Django",
    "Definição": "O Django é um framework de código aberto e gratuito, escrito na linguagem de programação Python. Com ele, o desenvolvedor é capaz de construir aplicações para a web com alta produtividade.",
    "Dificuldade": "Intrermediário",
    "Tags": "framework"
  },
  {
    "Termo": "DNS",
    "Definição": "O DNS (Domain Name System é Sistema de nome de domínio) é um serviço que converte nomes de domínio legíveis por humanos.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Docker",
    "Definição": "Plataforma open source que facilita a criação e administração de ambientes isolados. Ele possibilita o empacotamento de uma aplicação ou ambiente dentro de um container, se tornando portátil para qualquer outro host que contenha o Docker instalado.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Documentos de Requisitos",
    "Definição": "O documento de requisitos delimita o escopo do conjunto de funcionalidades que um sistema deve prover, bem como descreve os atributos de qualidade que devem ser suportados.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "DOM",
    "Definição": "O Modelo de Objeto de Documento (DOM) é uma representação estruturada do documento HTML como uma árvore. A maior parte dos navegadores utilizam o DOM e boa parte da lógica de programação de uma interface web é a manipulação do DOM.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, front-end"
  },
  {
    "Termo": "Double",
    "Definição": "Tipo de dado. Armazena números com ponto flutuante, com precisão dupla, ou seja normalmente possui o dobro da capacidade de uma variável do tipo float.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "Dry",
    "Definição": "Don't repeat yourself ou também conhecido pelo acrônimo DRY é um conceito de programação de computadores o qual propõe que cada pDon't repeat yourself ou também conhecido pelo acrônimo DRY é um conceito de programação de computadores o qual propõe que cada porção de conhecimento em um sistema deve possuir uma representação única, de autoridade e livre de ambiguidades em todo o sistema.\nDon't repeat yourself ou também conhecido pelo acrônimo DRY é um conceito de programação de computadores o qual propõe que cada porção de conhecimento em um sistema deve possuir uma representação única, de autoridade e livre de ambiguidades em todo o sistema.\nDon't repeat yourself ou também conhecido pelo acrônimo DRY é um conceito de programação de computadores o qual propõe que cada porção de conhecimento em um sistema deve possuir uma representação única, de autoridade e livre de ambiguidades em todo o sistema.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "EC2",
    "Definição": "O Amazon Elastic Compute Cloud oferece uma capacidade de computação na AWS (máquina virtual). O uso do Amazon EC2 elimina a necessidade de investir em hardware inicialmente.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Elasticsearch",
    "Definição": "Mecanismo de busca e análise de dados distribuído, gratuito e aberto para todos os tipos de dados, incluindo textuais, numéricos, geoespaciais, estruturados e não estruturados.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Electron",
    "Definição": "O Electron é um framework de código aberto para desenvolvimento de aplicações desktop utilizando tecnologias web.",
    "Dificuldade": "Intermediário",
    "Tags": "framework"
  },
  {
    "Termo": "Encoding",
    "Definição": "É uma forma de representar letras e símbolos em forma númerica, permitindo armazenar, transformar e transmití-los usando computadores.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "End to End",
    "Definição": "É uma maneira de realizar testes automatizados que abrangem todas as camadas de um sistema. Simula a maneira como um usuário real interage com o sistema.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Entidade",
    "Definição": "Uma entidade é uma representação de um conjunto de informações sobre determinado conceito do sistema. Toda entidade possui ATRIBUTOS, que são as informações que referenciam a entidade.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "ERP",
    "Definição": "ERP é um sistema de informação integrado que fornece um quadro abrangente para apoiar a gestão empresarial. O objetivo do ERP é integrar todas as áreas de uma empresa em um único sistema, permitindo que as informações flua livremente entre todos os departamentos.",
    "Dificuldade": "Profissional",
    "Tags": "Ferramentas, programas"
  },
  {
    "Termo": "Escalar",
    "Definição": "Uma variável é escalar se ela for um número, uma string ou outro tipo dos ditos \"primitivos\" em várias linguagens - que é distinto de uma estrutura com mais lógica e conjunto de operaçães como um objeto de uma classe ou um array.",
    "Dificuldade": "Inciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Escopo de Projeto",
    "Definição": "O escopo de projeto é o alcance do projeto, ou seja, o que deve ser feito para atingir os objetivos do projeto. O escopo do projeto também inclui os produtos, serviços e resultados entregues pelo projeto.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Escopo de Variável",
    "Definição": "O escopo de uma variável é o conjunto de linhas de código em que a variável é visível.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Express",
    "Definição": "Express é um popular framework web estruturado, escrito em JavaScript que roda sobre o ambiente Node.JS.",
    "Dificuldade": "Intermediário",
    "Tags": "framework"
  },
  {
    "Termo": "Figma",
    "Definição": "O Figma é uma ferramenta de design para interfaces, que oferece a possibilidade de trabalho colaborativo, ou seja, diversos membros de uma equipe podem explorar e atuar em um mesmo projeto. Ele funciona 100% online, como uma aplicação web.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas, programas"
  },
  {
    "Termo": "Float",
    "Definição": "Armazena números maiores que o tipo int e também números reais.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, fundamentos, comandos"
  },
  {
    "Termo": "Fluxograma",
    "Definição": "É uma forma padronizada eficaz para representar os passos lógicos de um determinado processamento (algoritmos).",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas, conceitos"
  },
  {
    "Termo": "For",
    "Definição": "O comando for permite que um certo trecho de programa seja executado repetidas vezes.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos, fundamentos"
  },
  {
    "Termo": "Form",
    "Definição": "Form (formulário) é um conjunto de componentes em uma página web que permitem ao usuário inserir dados como nomes.",
    "Dificuldade": "Iniciante",
    "Tags": "coneitos, front-end"
  },
  {
    "Termo": "Formik",
    "Definição": "É uma biblioteca para ReactJS que facilita a criação de formulários.",
    "Dificuldade": "Iniciante",
    "Tags": "bibliotecas"
  },
  {
    "Termo": "Framework",
    "Definição": "Frameworks é uma espécie de modelo que provê funcionalidades e componentes que facilitam a construção de aplicações. Existem vários tipos de frameworks, cada um com objetivos diferentes como: reusabilidade, produtividade, padrão de arquitetura.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Front-End",
    "Definição": "O desenvolvedor front-end é responsável pela interface de uma aplicação web.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, front-end"
  },
  {
    "Termo": "Full Stack",
    "Definição": "O Desenvolvimento Full Stack engloba a programação de forma completa: o front-end e o back-end e alguns casos o deployment.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Gist",
    "Definição": "O Gist é um compartilhador de pequenos trechos de código.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Git",
    "Definição": "O git é um software desenvolvido para o controle de alterações do código de um projeto, facilitando que vários desenvolvedores trabalhem ao mesmo tempo, de maneira rápida e eficiente.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas. Infraestrutura"
  },
  {
    "Termo": "GitHub",
    "Definição": "GitHub é uma plataforma de hospedagem de código-fonte e arquivos com controle de versão usando o Git. É como uma plataforma social colaborativa, onde programadores e empresas colocam seus projetos para o desenvolvimento do código.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Github Action",
    "Definição": "O Github Action (GHA) é uma ferramenta Open Source que permite automatizar, personalizar e executar fluxos de trabalho de desenvolvimento de software diretamente no seu repositório GitHub.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "GO",
    "Definição": "O Go é uma linguagem concebida pela Google para aprimorar o desenvolvimento de sistemas para processadores multicore, computadores em redes e codebases extensos, além de ser performática e produtiva.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas"
  },
  {
    "Termo": "GraphyQL",
    "Definição": "GraphQL é uma tecnologia open-source para a consulta e manipulação de dados em APIs. Seu objetivo é comparável ao objetivo da arquitetura REST e de outras arquiteturas de web services.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Gulp",
    "Definição": "Ferramenta de automação de tarefas em JavaScript. Tarefas como minificar, otimizar e compilar arquivos.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Hard Skills",
    "Definição": "Hard Skills são habilidades técnicas como a codificação, design de interfaces, criação de consultas de dados, etc e que podem ser comprovadas por meio de diplomas, certificações ou testes.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Hardware",
    "Definição": "Em um computador ou qualquer outro dispositivo composto por circuitos elétricos, o hardware é o conjunto dos componentes físicos internos e dos periféricos externos.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "HD",
    "Definição": "O HD é um componente de um computador que tem a finalidade de armazenar dados. Se difere da memória pelas informações contidas nele permanecem armazenadas para utiliza-lo independentemente se ele está desligado ou não.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Hospedagem",
    "Definição": "Hospedagem de site é um serviço online que permite a publicação de um site ou aplicação na internet.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "HTML",
    "Definição": "HTML (Linguagem de Marcação de HiperTexto) define os elementos e a estrutura do conteúdo de uma página web, como links, imagens, textos e formulários.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, fundamentos, front-end"
  },
  {
    "Termo": "HTTP",
    "Definição": "HTTP é um protocolo (protocol) que permite a obtenção de recursos de um servidores web, como documentos HTML. É a base de qualquer troca de dados na Web e um protocolo cliente-servidor, o que significa que as requisições são iniciadas pelo destinatário, geralmente um navegador.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "HTTPS",
    "Definição": "A sigla significa Hyper Text Transfer Protocol Secure (HTTPS). Esse protocolo é a combinação dos protocolos HTTP e SSL (Secure Sockets Layer).",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "IDE",
    "Definição": "Um IDE é um programa repleto de funcionalidades para o desenvolvimento de software como preenchimento de código, plugins, corretor de erros, acesso ao banco de dados, debugger e outras ferramentas.",
    "Dificuldade": "Iniciante",
    "Tags": "feramentas, programas"
  },
  {
    "Termo": "Identação",
    "Definição": "Inserir determinado espaço entre a margem da página e o início do texto de um parágrafo. Códigos devem seguir um padrão de identação para serem legíveis.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, infraestrutura"
  },
  {
    "Termo": "If",
    "Definição": "O if significa \"se\" e é como usamos os operadores lógicos de uma linguagem. Ele condiciona um comando a uma condição qualquer, executando-o apenas se ela for verdadeira. Sua gramática é \"if(condição){ faça isso }\".",
    "Dificuldade": "Iniciante",
    "Tags": "comandos, fundamentos"
  },
  {
    "Termo": "Int",
    "Definição": "Armazena valores numéricos inteiros.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos, fundamentos"
  },
  {
    "Termo": "Integração",
    "Definição": "Uma integração é a conexão de dados por uma API de um sistema para outro.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Interface",
    "Definição": "Elemento que proporciona uma ligação física ou lógica entre dois sistemas ou partes de um sistema que não poderiam ser conectados diretamente.",
    "Dificuldade": "Iniciante",
    "Tags": "coneitos"
  },
  {
    "Termo": "Interface",
    "Definição": "Meio pelo qual o usuário interage com um programa ou sistema operacional (parte gráfica da aplicação).",
    "Dificuldade": "Inciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Internet",
    "Definição": "Rede de computadores dispersos por todo o planeta que trocam dados utilizando um protocolo comum, unindo usuários particulares, entidades de pesquisa, órgãos culturais, institutos militares, bibliotecas e outras empresas.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Interpretador",
    "Definição": "Programa que traduz código de programação em código de máquina sem criar um arquivo executável do programa traduzido. Exemplo de linguagens interpretadas: Javascript, PHP, Python.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas"
  },
  {
    "Termo": "IP",
    "Definição": "Endereço IP significa endereço do Protocolo de Internet. O Protocolo de Internet é um conjunto de regras para comunicação pela internet. Um endereço IP identifica uma rede ou dispositivo na internet.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Java",
    "Definição": "Java é uma linguagem de programação e plataforma computacional usada para diversas aplicações.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas"
  },
  {
    "Termo": "JavaScript",
    "Definição": "JavaScript é uma linguagem de programação interpretada também conhecida como a linguagem de script da Internet. Ela é usada principalmente para definir regras e comportamentos dos elementos de uma página web.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Jenkins",
    "Definição": "Servidor de automação de deployment de código aberto capaz de realizar inúmeras tarefas relacionadas a CI e CD, como a criação de ambientes temporários para verificação do software, testes automatizados e o envio do software para o servidor principal.",
    "Dificuldade": "Intermediário",
    "Tags": "Ferramentas, programas"
  },
  {
    "Termo": "Jest",
    "Definição": "Jest é um framework de teste unitário de código aberto em JavaScript criado pelo Facebook a partir do framework Jasmine. Jest é uma das ferramentas de teste unitário mais difundidas dentro da comunidade de JavaScript.",
    "Dificuldade": "Intermediário",
    "Tags": "framework"
  },
  {
    "Termo": "Jquery",
    "Definição": "O jQuery é uma biblioteca JavaScript que facilita o uso de JavaScript (JS) em seu site.",
    "Dificuldade": "Iniciante",
    "Tags": "bibliotecas"
  },
  {
    "Termo": "Json",
    "Definição": "JSON, que significa JavaScript Object Notation, é uma formatação utilizada para estruturar dados em formato de texto e transmiti-los de um sistema para outro, como em aplicações cliente-servidor ou em aplicativos móveis.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "JWT",
    "Definição": "JWT ou JSON Web Token é um padrão da industria definido pela RFC7519 que tem como objetivo transmitir ou armazenar de forma compacta e segura objetos JSON entre diferentes aplicações. Usado geralmente para a autenticação e autorização de usuários.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Kafka",
    "Definição": "O Apache Kafka é uma plataforma distribuída de transmissão de dados que é capaz de publicar, subscrever, armazenar e processar fluxos de registro em tempo real.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Kanban",
    "Definição": "Uma ferramenta para auxiliar a equipe a executar suas tarefas com mais clareza e colabora-lo.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas, programas"
  },
  {
    "Termo": "Kernel",
    "Definição": "O kernel é o componente principal de um sistema operacional Linux e a interface central entre o hardware e os processos executados por um computador. Ele estabelece a comunicação entre ambos, gerenciando recursos com a maior eficiência possível.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Kiss",
    "Definição": "O princípio KISS afirma que uma solução deve ser mantida simples quando possível. Isso inclui maior legibilidade, compreensão e variabilidade. Outro argumento que é favorável às soluções mais simples é que, ao contrário de uma solução complexa, elas são mais fáceis de manter.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "LAN",
    "Definição": "Redes Locais interligam computadores presentes dentro de um mesmo espaço físico. Isso pode acontecer dentro de uma empresa, de uma escola ou dentro da sua própria casa, sendo possível a troca de informações e recursos entre os dispositivos participantes.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, infraestrutura"
  },
  {
    "Termo": "Lavarel",
    "Definição": "Laravel é um Framework PHP utilizado para o desenvolvimento web, que utiliza a arquitetura MVC e tem como principal característica ajudar a desenvolver aplicações seguras de forma rápida, com código limpo e simples.",
    "Dificuldade": "Intermediário",
    "Tags": "framework"
  },
  {
    "Termo": "Lecença de software",
    "Definição": "Uma licença de software, ou licença de programa de computador, é uma definição de ações autorizadas, no âmbito do direito de um programador de software ou empresa concedidas ao usuário deste software.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Legacy System",
    "Definição": "O termo sistema legado descreve um sistema antigo que permanece em operação dentro de uma organização.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "LIB",
    "Definição": "Uma lib (biblioteca) é um coleção de recursos que podem ser utilizados por inúmeros programas, sem conexão uns aos outros.",
    "Dificuldade": "Iniciante",
    "Tags": "bibliotecas"
  },
  {
    "Termo": "Linguagem de Máquina",
    "Definição": "É a linguagem de mais baixo nível de entendimento pelo ser humano e a única entendida pelo computador.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Linter",
    "Definição": "Também chamado de linter, o lint é uma ferramenta de análise de código estática. Ele é realizado para sinalizar erros de programação, erros estilísticos, bugs e construções suspeitas que possam prejudicar ou causar o baixo desempenho ao código da aplicação.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Linux",
    "Definição": "Linux é um Sistema Operacional, assim como o Windows e o Mac OS, que possibilita a execução de programas em um computador e outros dispositivos. Linux pode ser livremente modificado e distribuído.",
    "Dificuldade": "Inciante",
    "Tags": "conceitos, ferramentas"
  },
  {
    "Termo": "Local",
    "Definição": "Uma função ou varável local é uma estrutura de uma linguagem de programação que somente é possível de ser acessada dentro ou abaixo do escopo dela.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "LOG",
    "Definição": "Um log (em português \"diário\") é uma estrutura que recolhe cronologicamente todos os eventos que afetaram um sistema informático (software, aplicação, servidor, etc...) e todas as ações que resultaram desses eventos.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Lógica de Programação",
    "Definição": "Lógica de programação é a técnica de encadear pensamentos para atingir determinado objetivo. Estes pensamentos, podem ser descritos como uma sequência de instruções, que devem ser seguidas para se cumprir uma determinada tarefa.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Loop",
    "Definição": "Em programação, LOOP é uma instrução para o programa repetir tarefas. Exemplo: for, while, repeat.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "Manutenibilidade",
    "Definição": "A manutenibilidade é o conceito que busca contemplar os três tipos de manutenção já existentes: corretiva, preditiva e preventiva. Resumidamente, é a facilidade com que um código pode ser corrigido, melhorado ou receber novas funcionalidades.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Markdown",
    "Definição": "Markdown Syntax é uma sintaxe usada para padronizar e facilitar formatação de texto na web.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Matriz",
    "Definição": "Uma matriz é uma coleção de variáveis de mesmo tipo, acessíveis com um único nome e armazenados contiguamente na memória. Também pode ser vista como um vetor de vetores.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Memcached",
    "Definição": "O Memcached é um datastore na memória fácil de usar e de alta performance. Ele oferece uma solução madura e escalável de código aberto para oferecer tempos de resposta inferiores a 1 milissegundo para utilização como cache ou armazenamento de sessões.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Merge",
    "Definição": "Processo de fundir duas branches git em uma só.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Microserviços",
    "Definição": "Microsserviços são uma abordagem arquitetônica e organizacional do projeto de software na qual o software consiste em pequenas aplicações independentes que se comunicam usando APIs bem definidas.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Middleware",
    "Definição": "Middleware é um software ou trecho de código que se posiciona entre dois softwares ou dois trechos de códigos. Existem inúmeros tipos de middlewares, cada um com um objetivo diferente. Pode ser visto como uma \"cola\" de softwares.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Migration",
    "Definição": "Migration é uma maneira de realizar alterações em um banco de dados de forma organizada, controlada e passível de reversão. Trata-se de uma técnica muito comum no desenvolvimento em ambientes modernos de programação, como Ruby on Rails ou Laravel, por exemplo.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Mock",
    "Definição": "Objetos mock, objetos simulados ou simplesmente mock (do inglês mock object) são objetos que simulam o comportamento de objetos reais de forma controlada. São normalmente criados para testar o comportamento de outros objetos em testes automatizados.",
    "Dificuldade": "Intermediário",
    "Tags": "comandos, conceitos"
  },
  {
    "Termo": "Moment.js",
    "Definição": "O Moment.js é um pacote open source que pode ser utilizado para validar, manipular e fazer o parse de datas no JavaScript.",
    "Dificuldade": "Intermediário",
    "Tags": "biblioteclas"
  },
  {
    "Termo": "MongoDB",
    "Definição": "É um banco de dados opensource, de alta performance e flexível, sendo considerado o principal banco de dados NoSQL.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Monorepo",
    "Definição": "Monorepo é uma arquitetura em que você utiliza apenas um repositório que contêm vários projetos ao inves de distribuir esses projetos em vários repositórios.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "MVC",
    "Definição": "O MVC é uma sigla do termo em inglês Model (modelo) View (vis?o) e Controller (Controle). É um padrão de design útil e muito popular para separar as responsabilidades de diferentes trechos de códigos.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos, infraestrutura"
  },
  {
    "Termo": "MVP",
    "Definição": "Significa construir a versão mais simples e enxuta de um produto, empregando o mínimo possível de recursos para entregar a principal proposta de valor da ideia.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos, infraestrutura"
  },
  {
    "Termo": "MySQL",
    "Definição": "É um Banco de Dados relacional (RDBMS  Relational Database Management Systems) muito popular com um modelo de cliente-servidor.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Nginx",
    "Definição": "NGINX, pronunciado “engine-ex,” é um famoso software de código aberto para servidores HTTP, proxy reverso, balanceador de carga HTTP, e proxy de email para os protocolos IMAP, POP3, e SMTP.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "NodeJS",
    "Definição": "Um software gratuito e de código aberto que permite executar código JavaScript do lado do servidor.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "NoSQL",
    "Definição": "NoSQL é um termo genérico que representa os bancos de dados não relacionais, como MongoDB, CouchDB e Redis. Existem diversos tipos de bancos de dados NoSQL, como key-value, column-oriented, document, graph, multi-model e distributed.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "NPM",
    "Definição": "O NPM é uma ferramenta para o gerenciamento de pacotes Javascript. Ele permite instalar, desinstalar e atualizar dependências em uma aplicação por meio de uma simples instrução na linha de comando, entre outras funções.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Número binário",
    "Definição": "Sistema de numeração posicional em que todas as quantidades se representam com base em dois números (1 e 0).",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Observablilidade",
    "Definição": "Observabilidade descreve o quão bem você pode entender o que está acontecendo em um sistema, frequentemente instrumentando-o para coletar métricas, logs ou rastreamentos.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Offline",
    "Definição": "Que não tem ligação directa ou remota a um computador ou a uma rede de computadores, como a Internet.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Online",
    "Definição": "Termo que significa estar conectado a um computador ou a uma rede de computadores, como a Internet.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Open Source",
    "Definição": "É um código projetado para ser acessado abertamente pelo público: todas as pessoas podem vê-lo, modificá-lo e distribuí-lo conforme suas necessidades. Contudo seu uso pode ser restrito conforme a licença aplicado ao código.",
    "Dificuldade": "Inciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Orientação a Objetos",
    "Definição": "Programação Orientada a Objetos é um modelo de análise, projeto e programação de software baseado na composição e interação entre diversas unidades chamadas de 'objetos'.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "ORM",
    "Definição": "ORM é um tipo de programação que lida com a manipulação de dados em um banco de dados. Ele fornece um meio de mapping de objetos para os dados do banco de dados, permitindo que os dados sejam manipulados usando objetos em vez de SQL.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "OWASP",
    "Definição": "O Open Web Application Security Project (OWASP) é uma comunidade aberta dedicada a permitir que as organizações desenvolvam, comprem e mantenham aplicativos e APIs confiáveis através de artigos, metodologias e ferramentas.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas, programas"
  },
  {
    "Termo": "Pair Programming",
    "Definição": "Método de programação no qual duas pessoas trabalham juntas em um único programa.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "PHP",
    "Definição": "PHP é uma linguagem interpretada livre, é uma linguagem muito popular para a criação de aplicações web.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Plugin",
    "Definição": "Todo programa, ferramenta ou extensão que se encaixa a outro programa principal para adicionar mais funções e recursos a ele. Geralmente são leves e não comprometem o funcionamento do software e são de fácil instalação e manuseio.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "PostgreSQL",
    "Definição": "PostgreSQL é um sistema gerenciador de banco de dados objeto-relacional.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas, programas"
  },
  {
    "Termo": "Pseudocódigo",
    "Definição": "Pseudocódigo é uma forma genérica de escrever um algoritmo, utilizando uma linguagem simples (nativa a quem o escreve, de forma a ser entendida por qualquer pessoa) sem necessidade de conhecer a sintaxe de nenhuma linguagem de programação.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, fundamentos"
  },
  {
    "Termo": "Pull",
    "Definição": "É um comando git usado para buscar o conteúdo atual de um repositório remoto e imediatamente incorporar as alterações ao repositório atual.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "Pull Request",
    "Definição": "As pull requests permitem que você informe outras pessoas sobre as alterações das quais você fez push para um branch em um repositório.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "Push",
    "Definição": "É um comando git usado para fazer upload das alterações de um repositório local para um repositório remoto.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "Push",
    "Definição": "O que uma aplicação faz para enviar uma notificação a um aplicativo (push notifications).",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "PWA",
    "Definição": "PWA são páginas web que aparecem como aplicativos tradicionais ou móveis (nativos) ao usuário, combinando os recursos oferecidos pelos navegadores modernos com os benefícios da experiência móvel.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Python",
    "Definição": "Python é uma linguagem Open-Source de propósito geral popular para data science, machine learning, desenvolvimento de servidores web e automação de scripts.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas"
  },
  {
    "Termo": "QA",
    "Definição": "O conceito de Quality Assurance (QA), que pode ser traduzido como \"Controle de Qualidade\", faz referência a um profissional ou uma equipe cuja função é garantir que um software atende os requisitos e não contenha erros.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Query",
    "Definição": "Uma query é um pedido de uma informação ou de um dado. Esse pedido também pode ser entendido como uma consulta.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "RabbitMQ",
    "Definição": "RabbitMQ é um software de código aberto (open source) para lidar com o tráfego de mensagens entre diferentes aplicações em diversos formatos.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas, programas"
  },
  {
    "Termo": "Radio Button",
    "Definição": "Um radio button é uma opção de seleção em um formulário HTML. Um usuário pode selecionar apenas uma opção de cada vez.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "RAM",
    "Definição": "A memória RAM é responsável pelo armazenamento de informações necessárias para a execução de aplicativos em uso e para o funcionamento do próprio sistema operacional. Se difere do HD por perder todos os dados ao desligar o computador.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "RDBMS",
    "Definição": "Software de código aberto ou serviço usado na criação e gerenciamento de bancos de dados baseados no modelo relacional, como o MySQL e o PostgreSQL.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "React Native",
    "Definição": "O React Native é um framework baseado no framework React que possibilita o desenvolvimento de aplicações mobile, tanto para Android, como para iOS, utilizando apenas Javascript.",
    "Dificuldade": "Intermediário",
    "Tags": "framework"
  },
  {
    "Termo": "React Testing Library",
    "Definição": "É uma biblioteca que contém funções para testar o comportamento de componentes React.",
    "Dificuldade": "Intermediário",
    "Tags": "bibliotecas"
  },
  {
    "Termo": "Recharts",
    "Definição": "Rechart JS é uma biblioteca usada para criar gráficos para ReactJS. Esta biblioteca é usada para construir gráficos de linhas, gráficos de barras, gráficos de pizza e outros.",
    "Dificuldade": "Intermediário",
    "Tags": "bibliotecas"
  },
  {
    "Termo": "Recursividade",
    "Definição": "Recursividade é quando uma função chama a si própria.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, fundamentos"
  },
  {
    "Termo": "Redux",
    "Definição": "Biblioteca javascript feita para gerenciar estados da aplicação, ela tira a responsabilidade de um componente ter um estado que poderá ser usado por vários outros componentes e passa isso para um objeto global, que pode ser acessado por qualquer componente, a qualquer momento.",
    "Dificuldade": "Intermediário",
    "Tags": "bibliotecas"
  },
  {
    "Termo": "Refatoração",
    "Definição": "A refatoração é uma forma disciplinada de reestruturar o código quando pequenas mudanças são feitas nele para melhorar o design ou performance.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Regra de Negócio",
    "Definição": "Regras de negócio são declarações das particularidades das funcionalidades, operações, aspectos ou convenções de um sistema.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Remoto",
    "Definição": "Acesso remoto consiste na capacidade de um computador acessar, à distância, um outro computador ou de uma rede de computadores e, assim, visualizar arquivos, o desktop e até controlar programas e as funcionalidades dos dispositivos acessados.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Repositório",
    "Definição": "Repositório git é uma estrutura que armazena metadata, arquivos e estrutura de pastas de um projeto. Várias operações podem ser feitas nele, como cloná-lo em diferentes máquinas e criar ramificações de código para diferentes pessoas trabalharem em paralelo.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Request",
    "Definição": "A Request ou requisição traduzindo diretamente para português, é o pedido que um cliente realiza a nosso servidor. Esse pedido contém uma série de dados que são usados para descrever exatamente o que o cliente precisa.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Response",
    "Definição": "A Response (resposta) nada mais é do que a resposta que o servidor envia ao cliente. Essa resposta pode conter os dados que realmente o cliente esperava receber ou uma resposta informando que alguma coisa deu errado.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Responsividade",
    "Definição": "Sites responsivos são aqueles que adaptam o tamanho das suas páginas (alteração do layout) ao tamanho das telas que estão sendo exibidos.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, front-end, fundamentos"
  },
  {
    "Termo": "Rest",
    "Definição": "Concebido como uma abstração da arquitetura da web, trata-se de um conjunto de princípios e definições para a criação de um serviço web.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "RFC",
    "Definição": "RFC é o acrônimo para Request for Comments. Em português, significa \"solicitação de comentários\". RFC é um documento que contém a descrição de um protocolo de comunicação de dados ou de uma nova tecnologia da Internet.",
    "Dificuldade": "Profissional",
    "Tags": "conceitos"
  },
  {
    "Termo": "RGB",
    "Definição": "O sistema de cores RGB é encontrado em monitores de computador, televisão, câmeras digitais entre outros. As cores são atingidas com a mistura das três cores primárias (vermelho, verde e azul).",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Ruby",
    "Definição": "Ruby é uma linguagem de programação interpretada multiparadigma, de tipagem dinâmica e forte, com gerenciamento de memória automático.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Ruby on Rails",
    "Definição": "Um conjunto de bibliotecas escritas em Ruby que facilitam a criação de aplicações web.",
    "Dificuldade": "Intermediário",
    "Tags": "bibliotecas"
  },
  {
    "Termo": "Saas",
    "Definição": "SaaS, ou Software as a Service, é uma forma de disponibilizar softwares e soluções de tecnologia por meio da internet, como um serviço.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos, infraestrutura"
  },
  {
    "Termo": "Sass",
    "Definição": "O SASS é uma linguagem de extensão do CSS, a sua ideia é adicionar recursos especiais como variáveis, mixins, funções e operações e outras opções variadas.",
    "Dificuldade": "Iniciante",
    "Tags": "biblioteca"
  },
  {
    "Termo": "Schema",
    "Definição": "Schema se refere à estrutura e organização de um banco de dados (suas tabelas e seus relacionamentos).",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, infraestrutura"
  },
  {
    "Termo": "Scrum",
    "Definição": "Scrum é um conjunto de boas práticas empregado no gerenciamento de projetos complexos, em que não se conhece todas as etapas ou necessidades.",
    "Dificuldade": "Profissional",
    "Tags": "conceitos"
  },
  {
    "Termo": "Seeds",
    "Definição": "Seeds é um conjunto de dados a ser usado durante um teste automatizado, simulando dados reais de usuários.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Segurança",
    "Definição": "A segurança de um sistema de computação diz respeito à garantia de algumas propriedades fundamentais associadas às informações e recursos presentes no sistema.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "select / dropdown",
    "Definição": "Select input é um tipo de campo de formulário em que o usuário pode selecionar uma opção de uma lista.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "Semântica",
    "Definição": "Se refere à interpretação do código ou ao significado associado dos símbolos, caracteres ou qualquer parte de um programa.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "SEO",
    "Definição": "Search Engine Optimization (otimização de mecanismos de busca) e é o conjunto de técnicas usadas, geralmente divididas entre tecnologia, conteúdo e autoridade, para alcançar bom posicionamento de páginas de um site no Google e em outros buscadores, gerando tráfego orgânico.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos, front-end"
  },
  {
    "Termo": "Sequelize",
    "Definição": "O Sequelize é um ORM (Object-Relational Mapper) para Node.JS. Como ORM ele faz o mapeamento de dados relacionais (tabelas, colunas e linhas) para objetos Javascript.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Serverless",
    "Definição": "Serverless é um modelo de desenvolvimento nativo em nuvem para criação e execução de aplicações sem o gerenciamento de servidores. Os servidores ainda são usados nesse modelo, mas eles são abstraídos do desenvolvimento de aplicações.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Servidor",
    "Definição": "Um servidor é um computador equipado com um ou mais processadores, bancos de memória, portas de comunicação, softwares e, ocasionalmente, algum sistema para armazenamento de dados, como hard disks internos ou memórias SSD.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Servidor",
    "Definição": "O termo servidor também define um recurso de um sistema que somente é acessível a um cliente por meio de uma API.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "SGBD",
    "Definição": "Um Sistema de Gerenciamento de Banco de Dados é do inglês Data Base Management System (DBMS) é o sistema de software responsável pelo gerenciamento de um ou mais bancos de dados.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas, conceitos"
  },
  {
    "Termo": "Sintaxe",
    "Definição": "Refere-se às regras que regem a combinação de símbolos em declarações ou expressções que podem ser consideradas válidas em uma linguagem de programação.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Sistema Operacional (SO)",
    "Definição": "O sistema operacional refere-se a um ou mais softwares que tem como papel central gerenciar e ainda administrar todos os recursos presentes em um sistema. Isso envolve desde os componentes do hardware, sistemas de arquivos e até mesmo programas de terceiros. Exemplo: Windows, Android, macOS, Ubuntu.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "SOAP",
    "Definição": "SOAP é um protocolo de comunicação de informação estruturada em web services usando XML.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Soft Skills",
    "Definição": "As soft skills são habilidades comportamentais que um indivíduo possui na condução de suas atividades diárias. Ou seja: elas estão diretamente ligadas à forma como lidamos com as pessoas ou processos.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Software",
    "Definição": "Conjunto de componentes lógicos de um computador ou sistema de processamento de dados; programa, rotina ou conjunto de instruções que controlam o funcionamento de um computador; suporte lógico.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "SOLID",
    "Definição": "SOLID é um acrônimo de cinco princípios de design de programas orientados a objetos. Single-responsibility, open-closed, Liskov substitution, interface segregation, dependency inversion.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "SPA",
    "Definição": "SPA é a sigla para Single Page Application, ou seja, uma aplicação que carrega apenas uma página. Essa página é atualizada dinamicamente, conforme o usuário navega pelo conteúdo, sem precisar carregar uma nova página do servidor.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Spring",
    "Definição": "Framework criado com o intuito simplificar a programação em Java.",
    "Dificuldade": "Iniciante",
    "Tags": "framework"
  },
  {
    "Termo": "Sprint",
    "Definição": "Sprint é um conceito utilizado na metodologia Scrum que pode ser definido como um período curto de tempo que atividade pré-definidas devem ser realizadas.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "SQL",
    "Definição": "SQL é uma linguagem de consultas para trabalhar com bancos de dados relacionais. Ela é uma linguagem declarativa e que não necessita de profundos conhecimentos de programação para que alguém possa começar a escrevê-lo.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos, ferramentas"
  },
  {
    "Termo": "SQL Server",
    "Definição": "O SQL Server é um sistema gerenciador de banco de dados relacionais desenvolvido pela Microsoft.",
    "Dificuldade": "Intermediário",
    "Tags": "programas, ferramentas"
  },
  {
    "Termo": "Squads",
    "Definição": "Squads são pequenas equipes multidisciplinares, compostas por pessoas de diferentes habilidades e com um objetivo em comum.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "SSD",
    "Definição": "SSD ou Solid State Drive é um tipo de memória não volátil utilizada na indústria da tecnologia, principalmente em computadores, considerada a evolução dos hard disks.",
    "Dificuldade": "Iniciante",
    "Tags": "infraestrutura"
  },
  {
    "Termo": "SSH",
    "Definição": "SSH é um protocolo de execução de comandos e troca de arquivos entre cliente e servidor usando criptografia.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "SSL",
    "Definição": "SSL é um certificado de autenticidade de um site, possibilitando uma conexão critografada.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "SSR",
    "Definição": "Técnica popular para renderizar um aplicativo de página única (do inglês, SPA) no servidor e então enviar uma página previamente renderizada ao cliente, diminuindo a quantidade de processamento no lado do cliente.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Stack",
    "Definição": "Stack é o nome que damos ao conjunto de tecnologias sendo usadas no desenvolvimento de uma aplicação.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Stack Overflow",
    "Definição": "Plataforma gratuita de perguntas e respostas para programadores, estudantes e interessados em tecnologia e desenvolvimento. Nele, qualquer usuário pode publicar uma dúvida para ser respondida pelos outros membros do site.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Static Site Generator",
    "Definição": "Static Site Generator é uma aplicação que cria uma página HTML à partir de um template feito em Markdown, JSON e outros.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "String",
    "Definição": "String é um tipo de dado que consiste em uma sequência de caracteres.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "Stub",
    "Definição": "Um stub ou method stub, em português esboço de método, em desenvolvimento de software, é um pedaço de código usado para substituir algumas outras funcionalidades de programação.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Styled-Components",
    "Definição": "Styled-components é uma biblioteca para aplicações front-end que permite que você use estilos ao nível de componente na sua aplicação. Eles são escritos em uma mistura de JavaScript com CSS.",
    "Dificuldade": "Intermediário",
    "Tags": "biblioteca"
  },
  {
    "Termo": "SVG",
    "Definição": "Scalable Vector Grafhics, usada para descrever desenhos e gráficos vetoriais em duas dimensões. Podem ser redimensionado sem perda de qualidade, buscado, gerado por código e comprimidos. São armazenados em formato XML e são renderizados pela maior parte dos navegadores.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Tabela",
    "Definição": "Tabela em um banco de dados é uma coleção de dados dispostos em finitas colunas e infinitas linhas contendo propriedades como chaves primárias e estrangeiras.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "TDD",
    "Definição": "TDD é a sigla para Test Driven Development, que em português significa Desenvolvimento Orientado por Testes. Esse é um método de desenvolvimento onde testes são criados antes dos códigos do sistema si.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Terminal",
    "Definição": "É um programa que interage com o sistema operacional e outros aplicativos através de comandos de textos.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas, programas"
  },
  {
    "Termo": "Terminal",
    "Definição": "Terminal é todo o equipamento disponibilizado ao usuário, nomeadamente aquele que serve de interface com um sistema de informação mais abrangente.",
    "Dificuldade": "iniciante",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Teste de Turing",
    "Definição": "O Teste de Turing testa a capacidade de uma máquina exibir comportamento inteligente equivalente a um ser humano, ou indistinguível deste.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Testes Automatizados",
    "Definição": "Testes automatizados é basicamente um software que testará um programa. Muito útil na realização de testes repetitivos, porém necessários ou testes que seriam difíceis de serem feitos manualmente. Existem diversos tipos de testes automatizados, cada um com seu próprio objetivo.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Textarea",
    "Definição": "A textarea é um controle de formulário HTML que permite ao usu?áio inserir várias linhas de texto.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos, front-end"
  },
  {
    "Termo": "Thread",
    "Definição": "Thread é um pequeno programa que trabalha como um subsistema, sendo uma forma de um processo se autodividir em duas ou mais tarefas. É o termo em inglês para Linha ou Encadeamento de Execução.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos, ferramentas"
  },
  {
    "Termo": "Token",
    "Definição": "Token é um identificador único que representa um usuário, uma ação ou um objeto com informações sensíveis, como senhas ou cartões. Pode ser usado para autenticar, autorizar ou gerenciar o acesso a dados ou recursos.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Transpilar",
    "Definição": "Transpilar  uma mistura de compilar e traduzir. É o processo de transformar um código de uma linguagem para outra. Exemplo: de Typescript para Javascript.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Try",
    "Definição": "O comando try é uma estrutura de controle de exceções que permite que um programa execute um bloco de código quando um erro ou exceção for encontrada num sistema.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos, fundamentos"
  },
  {
    "Termo": "TSL",
    "Definição": "TSL é um acrônimo para Transport Layer Security. É um protocolo de segurança que foi projetado para prevenir que ataques de sniffing de rede e outros ataques de segurança.",
    "Dificuldade": "Intermediário",
    "Tags": "comandos"
  },
  {
    "Termo": "UI",
    "Definição": "UI é a interface do usuário, que é a forma como um usuário interage com um sistema, seja por meio de um aplicativo ou de um site. UI pode ser pensado como a \"camada de superfície\" de um sistema, que fornece acesso às funcionalidades do sistema.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos, front-end"
  },
  {
    "Termo": "Unit",
    "Definição": "Unit tests são testes que são executados em um único componente de software para garantir que ele está funcionando corretamente.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Upload",
    "Definição": "Upload é o processo de enviar um arquivo da sua máquina para um servidor.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "URL",
    "Definição": "URL é um acrônimo para Uniform Resource Locator e se refere à localização de um recurso na internet. Um URL fornece um meio de encontrar e localizar um recurso, geralmente um arquivo de texto, imagem ou página web, através de sua localização na internet.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Usabilidade",
    "Definição": "Usabilidade é o termo usado para descrever a facilidade com que um produto pode ser usado. A usabilidade de um produto pode afetar diretamente a satisfação do cliente e a longevidade do produto no mercado.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "UTF-8",
    "Definição": "UTF-8 é um conjunto de códigos de caracteres definido pelo Unicode e ISO 10646. É amplamente utilizado na Internet, permitindo que você visualize o texto em diferentes idiomas sem problemas.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos, conceitos"
  },
  {
    "Termo": "UX",
    "Definição": "UX é a sigla para User Experience (Experiência do Usuário). É o conjunto de atividades realizadas durante o desenvolvimento de um produto (digital ou não) que tem como objetivo criar eUX é a sigla para User Experience (Experiência do Usuário). É o conjunto de atividades realizadas durante o desenvolvimento de um produto (digital ou não) que tem como objetivo criar experiências positivas para os usuários, aumentando a satisfação, a fidelidade e o engajamento.\nUX é a sigla para User Experience (Experiência do Usuário). É o conjunto de atividades realizadas durante o desenvolvimento de um produto (digital ou não) que tem como objetivo criar experiências positivas para os usuários, aumentando a satisfação, a fidelidade e o engajamento.\nxperiências positivas para os usuários",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "Vetor",
    "Definição": "Um vetor é uma variável que pode conter mais de um valor. Em outras palavras, um vetor é um array de valores.",
    "Dificuldade": "Iniciante",
    "Tags": "comandos"
  },
  {
    "Termo": "Visual Studio Code",
    "Definição": "O Visual Studio Code é um editor de código aberto desenvolvido pela Microsoft para Windows, Linux e macOS. Ele suporta diversos linguagens de programação e também possui recursos para depuração, gerenciamento de versões e integração contínua.",
    "Dificuldade": "Iniciante",
    "Tags": "ferramentas, programas"
  },
  {
    "Termo": "VPN",
    "Definição": "Uma VPN (Virtual Private Network) é um método usado para adicionar segurança e privacidade às suas conexões na internet. Além disso, permite que você se conecte à internet em um endereço IP diferente, o que o torna mais difícil de ser rastreado e bloqueado por sites e serviços.",
    "Dificuldade": "Iniciante",
    "Tags": "conceitos"
  },
  {
    "Termo": "VueJS",
    "Definição": "VueJS é uma biblioteca de JavaScript criada com o objetivo de facilitar a criação de interfaces de usuário. A biblioteca foi criada por Evan You, e é mantida por uma comunidade de colaboradores.",
    "Dificuldade": "Intermediário",
    "Tags": "biblioteca"
  },
  {
    "Termo": "Web Service",
    "Definição": "Um web service é um serviço online que pode ser acessado por meio de um protocolo de rede. Ele pode fornecer informações ou realizar tarefas em nome do usuário.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "WebAssembly",
    "Definição": "WebAssembly é um novo tipo de código que pode ser executado pelos navegadores web de forma mais rápida e segura. Ele foi criado para permitir que aplicativos complexos sejam executados com velocidade semelhante à de um aplicativo nativo.",
    "Dificuldade": "Profissional",
    "Tags": "ferramentas"
  },
  {
    "Termo": "Webhook",
    "Definição": "Um webhook é uma forma de fornecer dados de notificação de forma instantânea a outros aplicativos quando um evento acontece. Eventos podem ser qualquer coisa, como um post de blog ou uma atualização de status de um pedido.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos, ferramentas"
  },
  {
    "Termo": "Webpack",
    "Definição": "Webpack é um empacotador de módulos JavaScript. Ele transforma os seus módulos JavaScript em um único arquivo (geralmente chamado de \"bundle.js\") que pode ser incluído no seu documento HTML.",
    "Dificuldade": "Profissional",
    "Tags": "ferramentas"
  },
  {
    "Termo": "WebSockets",
    "Definição": "WebSockets é uma tecnologia que permite a comunicação full-duplex (bidirecional) em tempo real entre o navegador e o servidor.",
    "Dificuldade": "Intermediário",
    "Tags": "ferramentas"
  },
  {
    "Termo": "While",
    "Definição": "O comando while é um comando de loop que avalia uma condição e, se ela for verdadeira, executa um bloco de código. O While loop continuará executando até que a condição se torne falsa.",
    "Dificuldade": "Inciante",
    "Tags": "comandos"
  },
  {
    "Termo": "Yagni",
    "Definição": "You aren't gonna need it\" (YAGNI) é um princípio da Extreme Programming (XP) que afirma que o programador não deve adicionar nenhuma funcionalidade até que ela seja realmente necessária.",
    "Dificuldade": "Intermediário",
    "Tags": "conceitos"
  },
  {
    "Termo": "Yup",
    "Definição": "YupJs é uma biblioteca de validação JavaScript para uso com o React. Ele pode ser usado para validar o formulário antes de enviá-lo para o servidor ou para fazer validações mais complexas no lado do cliente.",
    "Dificuldade": "Intermediário",
    "Tags": "bibliotecas"
  }
]